In [1]:
# Data Preprocessing

# Importing the dataset
dataset = read.csv('Data.csv')

# Taking care of missing data
dataset$Age = ifelse(is.na(dataset$Age),
                     ave(dataset$Age, FUN = function(x) mean(x, na.rm = TRUE)),
                     dataset$Age)
dataset$Salary = ifelse(is.na(dataset$Salary),
                        ave(dataset$Salary, FUN = function(x) mean(x, na.rm = TRUE)),
                        dataset$Salary)

In [2]:
head(dataset)

  Country Age Salary   Purchased
1 France  44  72000.00 No
2 Spain   27  48000.00 Yes
3 Germany 30  54000.00 No
4 Spain   38  61000.00 No
5 Germany 40  63777.78 Yes
6 France  35  58000.00 Yes

In [3]:
dataset$Country = factor(dataset$Country,
                         levels = c('France','Spain','Germany'),
                         labels = c(1,2,3))
dataset$Purchased = factor(dataset$Purchased,
                         levels = c('No','Yes'),
                         labels = c(0,1))

In [4]:
head(dataset)

  Country Age Salary   Purchased
1 1       44  72000.00 0
2 2       27  48000.00 1
3 3       30  54000.00 0
4 2       38  61000.00 0
5 3       40  63777.78 1
6 1       35  58000.00 1